In [22]:
from modules.module_for_imports import *

# Player Valuations

In [23]:
player_val = pd.read_csv('../Assignment_Data_2023-2024/player_valuations.csv')
player_val

,player_id,last_season,datetime,date,dateweek,market_value_in_eur,n,current_club_id,player_club_domestic_competition_id
0,3132,2013,2003-12-09 00:00:00,2003-12-09,2003-12-08,400000,1,126,TR1
1,6893,2012,2003-12-15 00:00:00,2003-12-15,2003-12-15,900000,1,984,GB1
2,10,2015,2004-10-04 00:00:00,2004-10-04,2004-10-04,7000000,1,398,IT1
3,26,2017,2004-10-04 00:00:00,2004-10-04,2004-10-04,1500000,1,16,L1
4,65,2015,2004-10-04 00:00:00,2004-10-04,2004-10-04,8000000,1,1091,GR1
...,...,...,...,...,...,...,...,...,...
440658,950091,2023,2023-09-21 00:00:00,2023-09-21,2023-09-18,1000000,1,1091,GR1
440659,968903,2023,2023-09-21 00:00:00,2023-09-21,2023-09-18,50000,1,653,GR1
440660,1031590,2023,2023-09-21 00:00:00,2023-09-21,2023-09-18,50000,1,6418,GR1
440661,1166093,2023,2023-09-21 00:00:00,2023-09-21,2023-09-18,50000,1,30120,GR1
440662,405676,2018,2023-12-19 00:00:00,2023-12-19,2023-12-18,50000,1,23826,L1

In [24]:
player_val.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 440663 entries, 0 to 440662
Data columns (total 9 columns):
 #   Column                               Non-Null Count   Dtype
---  ------                               --------------   -----
 0   player_id                            440663 non-null  int64
 1   last_season                          440663 non-null  int64
 2   datetime                             440663 non-null  object
 3   date                                 440663 non-null  object
 4   dateweek                             440663 non-null  object
 5   market_value_in_eur                  440663 non-null  int64
 6   n                                    440663 non-null  int64
 7   current_club_id                      440663 non-null  int64
 8   player_club_domestic_competition_id  440663 non-null  object
dtypes: int64(5), object(4)
memory usage: 30.3+ MB

In [29]:
player_val['datetime'] = pd.to_datetime(player_val['datetime'].astype('string'))
player_val['date'] = pd.to_datetime(player_val['date'].astype('string'))
#player_val['dateweek'] = pd.to_datetime(player_val['dateweek'].astype('string'))
player_val['player_club_domestic_competition_id'] = player_val['player_club_domestic_competition_id'].astype('string')

player_val[['datetime', 'date', 
            'dateweek', 'player_club_domestic_competition_id']]

         datetime       date    dateweek player_club_domestic_competition_id
0      2003-12-09 2003-12-09  2003-12-08                                 TR1
1      2003-12-15 2003-12-15  2003-12-15                                 GB1
2      2004-10-04 2004-10-04  2004-10-04                                 IT1
3      2004-10-04 2004-10-04  2004-10-04                                  L1
4      2004-10-04 2004-10-04  2004-10-04                                 GR1
...           ...        ...         ...                                 ...
440658 2023-09-21 2023-09-21  2023-09-18                                 GR1
440659 2023-09-21 2023-09-21  2023-09-18                                 GR1
440660 2023-09-21 2023-09-21  2023-09-18                                 GR1
440661 2023-09-21 2023-09-21  2023-09-18                                 GR1
440662 2023-12-19 2023-12-19  2023-12-18                                  L1

[440663 rows x 4 columns]

> # It seems that 'datetime' and 'date' have the same values (see below)
- The following commands have been executed before the casting of their columns.

In [30]:
dates_serie2 = ~(player_val['date'] == player_val['datetime'])
dates_serie2.sum()

0

> # Note that 'dateweek' and 'date' are not the same!

In [31]:
dates_serie = ~(player_val['date'] == player_val['dateweek'])
dates_serie.sum()

354369